# -*- jinx-languages: "es_ES"; -*-
#+title: Estructura de Datos
#+date: [2025-04-14 Mon 19:06]
#+filetags: :estudio:programacion:
#+identifier: 20250414T190644
#+author: Ing. Javier Pacheco
#+startup: showall

* DOING EJERCICIO: [1/2]
- [X] Muestra ejemplos de creación de todas las estructuras soportadas por defecto
  en tu lenguaje.
- [ ] Utiliza operaciones de inserción, borrado, actualización y ordenación.

* DIFICULTAD EXTRA (opcional): 
Crea una agenda de contactos por terminal.
- [ ] Debes implementar funcionalidades de búsqueda, inserción, actualización
  y eliminación de contactos.
- [ ] Cada contacto debe tener un nombre y un número de teléfono.
- [ ] El programa solicita en primer lugar cuál es la operación que se quiere realizar,
  y a continuación los datos necesarios para llevarla a cabo.
- [ ] El programa no puede dejar introducir números de teléfono no numéricos y con más
  de 11 dígitos (o el número de dígitos que quieras).
- [ ] También se debe proponer una operación de finalización del programa.

* Solución.
#+begin_src python
# lista
lista = [1,2,3,4,5]
# tupla
mi_tupla = ("a", "b", "c")
# Diccionario
mi_dict = {
    "Carro": 5,
    "Truck": 10
}
return mi_dict
#+end_src

#+RESULTS:
: {'Carro': 5, 'Truck': 10}

